nxp-mcuxpresso/mcux-sdk-examples/kw45b41zloc/demo_apps/shell/pin_mux.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTC0 (number 37), LED1_R1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED1_R1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED1_R1_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED1_R1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED1_R1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED1_R1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTC6 (number 44), LED2_Y2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED2_Y2_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED2_Y2_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED2_Y2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED2_Y2_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED2_Y2_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
